Public Attributes | List of all members
API_RailingHandrailQuantity Struct Reference
Element Manager
Calculated values for a handrail. More...
#include <APIdefs_Elements.h>
 Public Attributes
 double  | volume
The volume of the handrail.
 double  | length3D
The 3D length of the handrail's reference line.
Detailed Description
Calculated values for a handrail.